Revit 2026 API

# AdvancedOpaqueOpaqueEmission Property

---

The property labeled "Emission" from the "AdvancedOpaque" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string OpaqueEmission { get; }
```
```vb
Public Shared ReadOnly Property OpaqueEmission As String
	Get
```
```cpp
public:
static property String^ OpaqueEmission {
	String^ get ();
}
```
```fsharp
static member OpaqueEmission : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

AdvancedOpaque Class

Autodesk.Revit.DB.Visual Namespace